# Libraries

In [8]:
import numpy as np
import pandas as pd
import sqlite3 as sql

# .csv

In [9]:
data_csv = pd.read_csv("data/example_files/users.csv")
data_csv.head(3)

,name,surname,email,phone,house_number,street,city,state,zipcode
0,Herminia,Marshall,herminia.marshall@example.com,678-313-8625,4893,Hanifan Lane,Atlanta,GA,30303
1,Bernice,Richardson,bernice.richardson@example.com,406-640-0952,4508,Coolidge Street,Beach,MT,58621
2,Maeleachlainn,Albertson,maeleachlainn.albertson@example.com,936-514-5533,1345,Norma Avenue,Prairie View,TX,77445

# .tsv

In [10]:
data_tsv = pd.read_csv("data/example_files/users.tsv", sep="\t")
data_tsv.head(3)

,name,surname,email,phone,house_number,street,city,state,zipcode
0,Herminia,Marshall,herminia.marshall@example.com,678-313-8625,4893,Hanifan Lane,Atlanta,GA,30303
1,Bernice,Richardson,bernice.richardson@example.com,406-640-0952,4508,Coolidge Street,Beach,MT,58621
2,Maeleachlainn,Albertson,maeleachlainn.albertson@example.com,936-514-5533,1345,Norma Avenue,Prairie View,TX,77445

# .xlsx

In [13]:
data_xlsx = pd.read_excel("data/example_files/users.xlsx")
data_xlsx.head(3)

,name,surname,email,phone,house_number,street,city,state,zipcode
0,Herminia,Marshall,herminia.marshall@example.com,678-313-8625,4893,Hanifan Lane,Atlanta,GA,30303
1,Bernice,Richardson,bernice.richardson@example.com,406-640-0952,4508,Coolidge Street,Beach,MT,58621
2,Maeleachlainn,Albertson,maeleachlainn.albertson@example.com,936-514-5533,1345,Norma Avenue,Prairie View,TX,77445

# .json

In [12]:
data_json = pd.read_json("data/example_files/users.json")
data_json.head(3)

,name,surname,email,phone,house_number,street,city,state,zipcode
0,Herminia,Marshall,herminia.marshall@example.com,678-313-8625,4893,Hanifan Lane,Atlanta,GA,30303
1,Bernice,Richardson,bernice.richardson@example.com,406-640-0952,4508,Coolidge Street,Beach,MT,58621
2,Maeleachlainn,Albertson,maeleachlainn.albertson@example.com,936-514-5533,1345,Norma Avenue,Prairie View,TX,77445

# SQL

In [15]:
conn = sql.connect("data/example_files/users.db")
data_sql = pd.read_sql("SELECT * FROM users;", conn)
conn.close()

data_sql.head(3)

,name,surname,email,phone,house_number,street,city,state,zipcode
0,Herminia,Marshall,herminia.marshall@example.com,678-313-8625,4893,Hanifan Lane,Atlanta,GA,30303
1,Bernice,Richardson,bernice.richardson@example.com,406-640-0952,4508,Coolidge Street,Beach,MT,58621
2,Maeleachlainn,Albertson,maeleachlainn.albertson@example.com,936-514-5533,1345,Norma Avenue,Prairie View,TX,77445

# URL

# Reading Large Files